#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-cloud-resume-iac-challenge/runs/run-LWM7tinnAsZ3bRpV

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
random_string.bucket_suffix: Refreshing state... [id=l4p4u37k]
data.archive_file.lambda_zip: Refreshing...
data.archive_file.lambda_zip: Refresh complete after 0s [id=e0ec9d6d64322ee6c9df2c519b5eb2f1f96cc00b]
aws_cloudfront_origin_access_control.resume_oac: Refreshing state... [id=E1OEEPD3COCGTC]
aws_s3_bucket_public_access_block.resume_bucket_block: Refreshing state... [id=my-unique-resume-bucket-l4p4u37k]
aws_iam_role.lambda_role: Refreshing state... [id=resume_lambda_role]
aws_s3_bucket_website_configuration.resume_config: Refreshing state... [id=my-unique-resume-bucket-l4p4u37k]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/resume_counter]
aws_iam_role_policy_attachment.db_attach: Refreshing state... [id=resume_lambda_role-20260114073007689400000003]
aws_iam_policy.lambda_db_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/resume_lambda_db_policy]
aws_apigatewayv2_api.resume_api_gw: Refreshing state... [id=n7ahbteud7]
aws_dynamodb_table.visitor_count: Refreshing state... [id=VisitorCount]
aws_s3_bucket.resume_bucket: Refreshing state... [id=my-unique-resume-bucket-l4p4u37k]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=resume_lambda_role-20260114072958094700000001]
aws_lambda_function.resume_api: Refreshing state... [id=resume_counter]
aws_apigatewayv2_stage.api_stage: Refreshing state... [id=$default]
aws_lambda_permission.api_gw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=xa9z3tq]
aws_apigatewayv2_route.api_route: Refreshing state... [id=3cq56sc]
aws_s3_object.index: Refreshing state... [id=index.html]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2NS8S8TIXZ18K]
aws_s3_bucket_policy.allow_access_from_cloudfront: Refreshing state... [id=my-unique-resume-bucket-l4p4u37k]
aws_iam_role.lambda_role: Drift detected (update)
aws_lambda_function.resume_api: Drift detected (update)
aws_s3_object.index: Drift detected (update)
aws_cloudfront_distribution.s3_distribution: Drift detected (update)
aws_dynamodb_table.visitor_count: Drift detected (update)
aws_apigatewayv2_api.resume_api_gw: Drift detected (update)
aws_apigatewayv2_integration.lambda_integration: Drift detected (update)
aws_s3_bucket.resume_bucket: Drift detected (update)
aws_iam_policy.lambda_db_policy: Drift detected (update)
aws_cloudwatch_log_group.lambda_log_group: Drift detected (update)
aws_apigatewayv2_stage.api_stage: Drift detected (update)
aws_apigatewayv2_route.api_route: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_api.resume_api_gw will be updated in-place
  ~ resource "aws_apigatewayv2_api" "resume_api_gw" {
        id                           = "n7ahbteud7"
        name                         = "resume-api-gw"
        tags                         = {}
      ~ tags_all                     = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_stage.api_stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "api_stage" {
        id                    = "$default"
        name                  = "$default"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E2NS8S8TIXZ18K"
      ~ is_ipv6_enabled                 = true -> false
        tags                            = {}
      ~ tags_all                        = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (20 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "my-unique-resume-bucket-l4p4u37k.s3.ap-southeast-1.amazonaws.com" -> null
          - origin_access_control_id = "E1OEEPD3COCGTC" -> null
          - origin_id                = "S3Origin" -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E1OEEPD3COCGTC"
          + origin_id                = "S3Origin"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/resume_counter"
        name              = "/aws/lambda/resume_counter"
        tags              = {}
      ~ tags_all          = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_dynamodb_table.visitor_count will be updated in-place
  ~ resource "aws_dynamodb_table" "visitor_count" {
        id                          = "VisitorCount"
        name                        = "VisitorCount"
        tags                        = {}
      ~ tags_all                    = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.lambda_db_policy will be destroyed
  - resource "aws_iam_policy" "lambda_db_policy" {
      - arn              = "arn:aws:iam::871308866502:policy/resume_lambda_db_policy" -> null
      - attachment_count = 1 -> null
      - description      = "Allow Lambda to update DynamoDB" -> null
      - id               = "arn:aws:iam::871308866502:policy/resume_lambda_db_policy" -> null
      - name             = "resume_lambda_db_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-1:871308866502:table/VisitorCount"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA4VXQOGPDI36X63YZK" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.lambda_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_role" {
        id                    = "resume_lambda_role"
        name                  = "resume_lambda_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_db_policy will be created
  + resource "aws_iam_role_policy" "lambda_db_policy" {
      + id          = (known after apply)
      + name        = "LambdaDynamoDBAccess"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-1:871308866502:table/VisitorCount"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "resume_lambda_role"
    }

  # aws_iam_role_policy_attachment.db_attach will be destroyed
  - resource "aws_iam_role_policy_attachment" "db_attach" {
      - id         = "resume_lambda_role-20260114073007689400000003" -> null
      - policy_arn = "arn:aws:iam::871308866502:policy/resume_lambda_db_policy" -> null
      - role       = "resume_lambda_role" -> null
    }

  # aws_lambda_function.resume_api will be updated in-place
  ~ resource "aws_lambda_function" "resume_api" {
      ~ architectures                  = [
          ~ "x86_64" -> "arm64",
        ]
        id                             = "resume_counter"
      ~ last_modified                  = "2026-01-14T07:30:07.739+0000" -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.13"
        tags                           = {}
      ~ tags_all                       = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      ~ timeout                        = 3 -> 10
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.resume_bucket must be replaced
-/+ resource "aws_s3_bucket" "resume_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::my-unique-resume-bucket-l4p4u37k" -> (known after apply)
      ~ bucket                      = "my-unique-resume-bucket-l4p4u37k" -> "cloud-resume-l4p4u37k" # forces replacement
      ~ bucket_domain_name          = "my-unique-resume-bucket-l4p4u37k.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "my-unique-resume-bucket-l4p4u37k.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
      ~ id                          = "my-unique-resume-bucket-l4p4u37k" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::871308866502:distribution/E2NS8S8TIXZ18K"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::my-unique-resume-bucket-l4p4u37k/*"
                      - Sid       = "AllowCloudFrontServicePrincipalReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ap-southeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      ~ website_domain              = "s3-website-ap-southeast-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "my-unique-resume-bucket-l4p4u37k.s3-website-ap-southeast-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "74d13fa2e70e29cfaafe00b1c1d0169937308220ffeb3874b58e1e9190a4ca4d" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
      - website {
          - index_document           = "index.html" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_s3_bucket_lifecycle_configuration.resume_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "resume_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "archive-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "GLACIER"
            }
        }
    }

  # aws_s3_bucket_policy.allow_access_from_cloudfront must be replaced
-/+ resource "aws_s3_bucket_policy" "allow_access_from_cloudfront" {
      ~ bucket = "my-unique-resume-bucket-l4p4u37k" -> (known after apply) # forces replacement
      ~ id     = "my-unique-resume-bucket-l4p4u37k" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::871308866502:distribution/E2NS8S8TIXZ18K"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::my-unique-resume-bucket-l4p4u37k/*"
                      - Sid       = "AllowCloudFrontServicePrincipalReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.resume_block will be created
  + resource "aws_s3_bucket_public_access_block" "resume_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.resume_bucket_block will be destroyed
  - resource "aws_s3_bucket_public_access_block" "resume_bucket_block" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "my-unique-resume-bucket-l4p4u37k" -> null
      - id                      = "my-unique-resume-bucket-l4p4u37k" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_versioning.resume_versioning will be created
  + resource "aws_s3_bucket_versioning" "resume_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.resume_config will be destroyed
  - resource "aws_s3_bucket_website_configuration" "resume_config" {
      - bucket                = "my-unique-resume-bucket-l4p4u37k" -> null
      - id                    = "my-unique-resume-bucket-l4p4u37k" -> null
      - website_domain        = "s3-website-ap-southeast-1.amazonaws.com" -> null
      - website_endpoint      = "my-unique-resume-bucket-l4p4u37k.s3-website-ap-southeast-1.amazonaws.com" -> null
        # (2 unchanged attributes hidden)

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # aws_s3_object.index must be replaced
-/+ resource "aws_s3_object" "index" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::my-unique-resume-bucket-l4p4u37k/index.html" -> (known after apply)
      ~ bucket                        = "my-unique-resume-bucket-l4p4u37k" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content                       = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="UTF-8">
                <meta name="viewport" content="width=device-width, initial-scale=1.0">
          -     <title>Cloud Resume | Infrastructure Engineer</title>
          +     <title>Tan Si Kai | Cloud Infrastructure Engineer</title>
          +     <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.0.0/css/all.min.css">
                <style>
          -         /* Modern CSS Variables for easy color changes */
                    :root {
                        --primary: #2563eb;
          -             --bg: #f8fafc;
          -             --text: #1e293b;
          +             --primary-dark: #1d4ed8;
          +             --bg: #f1f5f9;
          +             --text: #0f172a;
          +             --text-light: #64748b;
                        --card-bg: #ffffff;
          +             --accent: #dbeafe;
                    }
            
          +         * { box-sizing: border-box; margin: 0; padding: 0; }
          + 
                    body { 
          -             font-family: 'Inter', -apple-system, sans-serif; 
          -             line-height: 1.7; 
          -             max-width: 900px; 
          -             margin: auto; 
          -             padding: 40px 20px; 
          -             background: var(--bg);
          +             font-family: 'Inter', -apple-system, system-ui, sans-serif; 
          +             line-height: 1.6; 
          +             background: linear-gradient(135deg, #e2e8f0 0%, #f8fafc 100%);
                        color: var(--text);
          +             padding: 40px 20px;
          +             min-height: 100vh;
                    }
            
          +         .container {
          +             max-width: 850px;
          +             margin: auto;
          +         }
          + 
                    .card { 
                        background: var(--card-bg); 
          -             padding: 3rem; 
          -             border-radius: 12px; 
          -             box-shadow: 0 10px 15px -3px rgba(0,0,0,0.1); 
          +             padding: 3.5rem; 
          +             border-radius: 16px; 
          +             box-shadow: 0 20px 25px -5px rgba(0,0,0,0.1), 0 10px 10px -5px rgba(0,0,0,0.04); 
          +             position: relative;
          +             overflow: hidden;
                    }
            
          -         h1 { font-size: 2.5rem; color: #0f172a; margin-bottom: 0.5rem; }
          -         h2 { color: var(--primary); border-bottom: 2px solid #e2e8f0; padding-bottom: 10px; margin-top: 2rem; }
          -         
          -         .skills-list { display: flex; flex-wrap: wrap; gap: 10px; list-style: none; padding: 0; }
          -         .skills-list li { background: #dbeafe; color: #1e40af; padding: 5px 15px; border-radius: 20px; font-weight: 600; font-size: 0.9rem; }
          +         /* Subtle top border accent */
          +         .card::before {
          +             content: "";
          +             position: absolute;
          +             top: 0; left: 0; right: 0;
          +             height: 6px;
          +             background: var(--primary);
          +         }
            
          +         header { text-align: center; margin-bottom: 3rem; }
          +         h1 { font-size: 2.8rem; letter-spacing: -0.025em; margin-bottom: 0.5rem; }
          +         header p { color: var(--text-light); font-size: 1.2rem; font-weight: 500; }
          + 
          +         h2 { 
          +             font-size: 1.4rem;
          +             text-transform: uppercase;
          +             letter-spacing: 0.05em;
          +             color: var(--primary); 
          +             margin: 2.5rem 0 1.2rem;
          +             display: flex;
          +             align-items: center;
          +             gap: 10px;
          +         }
          + 
          +         h2::after {
          +             content: "";
          +             flex: 1;
          +             height: 1px;
          +             background: #e2e8f0;
          +         }
          + 
          +         /* Skills Tag Styling */
          +         .skills-list { display: flex; flex-wrap: wrap; gap: 12px; list-style: none; }
          +         .skills-list li { 
          +             background: var(--accent); 
          +             color: var(--primary-dark); 
          +             padding: 6px 16px; 
          +             border-radius: 8px; 
          +             font-weight: 600; 
          +             font-size: 0.85rem;
          +             transition: all 0.3s ease;
          +             cursor: default;
          +         }
          +         .skills-list li:hover { 
          +             transform: translateY(-3px);
          +             background: var(--primary);
          +             color: white;
          +             box-shadow: 0 4px 6px -1px rgba(37, 99, 235, 0.4);
          +         }
          + 
          +         /* Journey/Blog Box */
                    .blog-section { 
          -             background: #f1f5f9; 
          -             padding: 20px; 
          +             background: #f8fafc; 
          +             padding: 24px; 
          +             border: 1px solid #e2e8f0;
                        border-left: 5px solid var(--primary); 
          -             margin-top: 30px;
          -             border-radius: 0 8px 8px 0;
          +             border-radius: 0 12px 12px 0;
          +             margin: 2rem 0;
                    }
          +         .blog-section h3 { margin-bottom: 10px; color: var(--text); }
          +         
          +         .btn {
          +             display: inline-block;
          +             margin-top: 15px;
          +             padding: 10px 20px;
          +             background: var(--primary);
          +             color: white !important;
          +             border-radius: 6px;
          +             text-decoration: none;
          +             transition: background 0.2s;
          +         }
          +         .btn:hover { background: var(--primary-dark); text-decoration: none !important; }
            
          +         /* Counter Styling */
                    .counter { 
          -             margin-top: 40px; 
          +             margin-top: 4rem; 
          +             padding: 20px;
          +             border-top: 1px solid #f1f5f9;
                        text-align: center;
          -             font-size: 1.1rem;
          -             color: #64748b;
          +             font-size: 0.95rem;
          +             color: var(--text-light);
                    }
          +         #visitor-count { font-weight: 800; color: var(--primary); font-size: 1.2rem; }
            
          -         #visitor-count { font-weight: bold; color: var(--primary); }
          -         
          -         a { color: var(--primary); text-decoration: none; font-weight: 600; }
          -         a:hover { text-decoration: underline; }
          +         /* Footer / Contact */
          +         footer {
          +             margin-top: 2rem;
          +             text-align: center;
          +             display: flex;
          +             justify-content: center;
          +             gap: 20px;
          +         }
          +         footer a { color: var(--text-light); font-size: 1.5rem; transition: color 0.2s; }
          +         footer a:hover { color: var(--primary); }
          + 
          +         @media (max-width: 600px) {
          +             .card { padding: 1.5rem; }
          +             h1 { font-size: 2rem; }
          +         }
                </style>
            </head>
            <body>
          -     <div class="card">
          -         <header>
          -             <h1>Your Name</h1>
          -             <p>Cloud Solutions Architect & Infrastructure Enthusiast</p>
          -         </header>
          +     <div class="container">
          +         <div class="card">
          +             <header>
          +                 <h1>Tan Si Kai</h1>
          +                 <p>Cloud Solutions Architect & DevSecOps Engineer</p>
          +             </header>
            
          -         <section>
          -             <h2>Cloud Experience</h2>
          -             <ul class="skills-list">
          -                 <li>Terraform (IaC)</li>
          -                 <li>AWS CloudFront</li>
          -                 <li>Amazon S3</li>
          -                 <li>Lambda & Python</li>
          -                 <li>DynamoDB</li>
          -                 <li>API Gateway</li>
          -             </ul>
          -         </section>
          +             <section>
          +                 <h2><i class="fas fa-cloud"></i> Technical Skills</h2>
          +                 <ul class="skills-list">
          +                     <li>AWS (S3, Lambda, CloudFront)</li>
          +                     <li>Terraform (IaC)</li>
          +                     <li>CI/CD (GitHub Actions)</li>
          +                     <li>Python & Boto3</li>
          +                     <li>REST APIs</li>
          +                     <li>NoSQL (DynamoDB)</li>
          +                     <li>Docker</li>
          +                 </ul>
          +             </section>
            
          -         <section class="blog-section">
          -             <h3>Infrastructure Journey</h3>
          -             <p>
          -                 As part of this project, I fully automated my cloud infrastructure using <strong>Terraform</strong>. 
          -                 I learned how to secure an S3 origin with CloudFront OAC and manage serverless backends as code.
          -             </p>
          -             <p>
          -                 📖 <strong>Read my full project write-up:</strong> 
          -                 <a href="https://your-blog-link.com/cloud-resume-terraform" target="_blank">Building a Serverless Resume with Terraform</a>
          -             </p>
          -         </section>
          +             <section>
          +                 <h2><i class="fas fa-certificate"></i> Certifications</h2>
          +                 <ul class="skills-list">
          +                     <li>AWS Certified Solutions Architect – Associate</li>
          +                     <li>HashiCorp Certified: Terraform Associate</li>
          +                 </ul>
          +             </section>
            
          -         <div class="counter">
          -             ✨ This resume has been viewed <span id="visitor-count">...</span> times.
          +             <section class="blog-section">
          +                 <h3>The Cloud Resume Challenge</h3>
          +                 <p>
          +                     I built this serverless website to demonstrate full-stack cloud proficiency. 
          +                     The architecture includes a <strong>CloudFront OAC</strong> secured S3 bucket, a 
          +                     <strong>GitHub Actions</strong> CI/CD pipeline, and a visit counter powered by 
          +                     Lambda and DynamoDB.
          +                 </p>
          +                 <a href="#" class="btn"><i class="fab fa-medium"></i> Read the Technical Blog</a>
          +             </section>
          + 
          +             <div class="counter">
          +                 <i class="fas fa-eye"></i> This profile has been viewed <span id="visitor-count">0</span> times
          +             </div>
                    </div>
          + 
          +         <footer>
          +             <a href="https://github.com/your-username" target="_blank" title="GitHub"><i class="fab fa-github"></i></a>
          +             <a href="https://linkedin.com/in/your-username" target="_blank" title="LinkedIn"><i class="fab fa-linkedin"></i></a>
          +             <a href="mailto:your-email@example.com" title="Email"><i class="fas fa-envelope"></i></a>
          +         </footer>
                </div>
            
                <script>
                    const apiURL = 'https://n7ahbteud7.execute-api.ap-southeast-1.amazonaws.com/getcount';
            
                    async function getCounter() {
                        try {
          -                 let response = await fetch(apiURL);
          -                 let data = await response.json();
          +                 const response = await fetch(apiURL);
          +                 const data = await response.json();
                            document.getElementById('visitor-count').innerText = data.count;
                        } catch (err) {
                            console.error("Error fetching counter:", err);
          -                 document.getElementById('visitor-count').innerText = "error";
          +                 document.getElementById('visitor-count').innerText = "1"; // Fallback
                        }
                    }
                    getCounter();
                </script>
            </body>
            </html>
        EOT
      ~ etag                          = "04f90c0d945a69a6532c19e5e623db9c" -> "b031d3aad49ab16dec0b71ba878d8383"
      ~ id                            = "index.html" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 7 to change, 7 to destroy.

Changes to Outputs:
  ~ s3_bucket_name = "my-unique-resume-bucket-l4p4u37k" -> "cloud-resume-l4p4u37k"

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ShenLoong99, Action: `pull_request`*